Revit 2027 API
ExternallyTaggedNonBRep Constructor
 Constructs an ExternallyTaggedGeometryObject associating a given ExternalGeometryId with a particular GeometryObject.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternallyTaggedNonBRep(
	ExternalGeometryId externalId,
	GeometryObject geometry
)
Public Sub New (
	externalId As ExternalGeometryId,
	geometry As GeometryObject
)
public:
ExternallyTaggedNonBRep(
	ExternalGeometryId^ externalId,
	GeometryObject^ geometry
)
new :
        externalId : ExternalGeometryId *
        geometry : GeometryObject -> ExternallyTaggedNonBRep
Parameters
externalId ExternalGeometryId
 The Id of the input geometry object.
geometry GeometryObject
 The externally tagged geometry object.
Exceptions
Exception | Condition
ArgumentException |  geometry must not be a Solid. -or- geometry must not have sub-nodes.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternallyTaggedNonBRep Class
Autodesk.Revit.DB Namespace